<?php

return [

    /*
    |--------------------------------------------------------------------------
    | All String for Salt project
    |--------------------------------------------------------------------------
    */

    'salt' => 'អំបិល',
    'user' => 'អ្នកប្រើ',
    'user_mgmt' => 'ការគ្រប់គ្រងអ្នកប្រើ',
    'facility' => 'សិប្បកម្ម',
    'facility_mgmt' => 'ការគ្រប់គ្រងសិប្បកម្ម',
    'report' => 'របាយការណ៍',
    'monthly_report' => 'របាយការណ៍ប្រចាំខែ',
    '' => '',
    '' => '',
    '' => '',
    '' => '',
    '' => '',

];