<?php

return [

    /*
    |--------------------------------------------------------------------------
    | All String for Salt project
    |--------------------------------------------------------------------------
    */

    'salt' => 'Salt',
    'user' => 'User',
    /** Login */
    'login' => 'ចូល​ប្រើប្រាស់',
    'email_address' => 'អាសយដ្ឋាន​អ៊ីមែល',
    'remember_me' => 'ចងចាំ​ខ្ញុំ',
    'forgot_password' => 'ភ្លេច​លេខសម្ងាត់​?',
    /** User mgmt */
    'user_mgmt' => 'ការគ្រប់គ្រង​អ្នកប្រើប្រាស់',
    'add_user' => 'បន្ថែម​អ្នកប្រើប្រាស់​ថ្មី',
    'name' => 'ឈ្មោះ',
    'user_email' => 'អ៊ីមែល',
    'modal_edit_user' => 'កែតម្រូវ​ព័ត៌មាន​អ្នកប្រើប្រាស់',
    /** User Role */
    'user_role' => 'តួនាទី',
    'admin' => 'រដ្ឋបាល',
    'producer' => 'ផលិករ',
    'monitor' => 'អ្នកពិនិត្យ​តាមដាន',
    'password' => 'លេខសម្ងាត់',
    'password_confirm' => 'បញ្ជាក់​បន្ថែម​លេខសម្ងាត់',
    'select_user_option' => 'សូម​ជ្រើសរើស​តួនាទី​របស់​អ្នកប្រើប្រាស់',
    'select_facility_option' => 'សូម​ជ្រើសរើស​មូលដ្ឋាន​ផលិត',
    /** Reset Password */
//    'show_pwd' => 'Show Password',
    'reset_password' => 'តម្លើង​លេខសម្ងាត់​ជា​ថ្មី',
    /** Facility mgmt */
//    'facility' => 'Facilities',
    'facility_mgmt' => 'ការគ្រប់គ្រង​មូលដ្ឋាន​ផលិត',
    'add_facility' => 'បន្ថែម​មូលដ្ឋាន​ផលិត​ថ្មី',
    'facility_name' => 'ឈ្មោះ​មូលដ្ឋាន​ផលិត',
    'facility_ref_id' => 'លេខ​សម្គាល់​មូលដ្ឋាន​ផលិត',
    'lat' => 'រយៈទទឹង',
    'long' => 'រយៈបណ្តោយ',
    /** Action buttons */
    'action' => 'សកម្មភាព',
    'edit' => 'កែតម្រូវ',
    'delete' => 'លុបចោល',
    'save' => 'រក្សាទុក',
    'cancel' => 'បោះបង់',
    'action_confirm_question' => 'តើ​អ្នក​ប្រាកដ​ជា​ចង់​អនុវត្ត​តាម​សកម្មភាព​នេះ​មែន​ទេ​?',
    'action_confirm_yes' => 'ចុច​ "លុបចោល" ​ដើម្បី​លុប​កំណត់ត្រា​ទាំងនេះ',
    'action_confirm_no' => 'ចុច​ "បោះបង់" ​ដើម្បី​លុបចោល',
    'dialog_confirm' => 'ការបញ្ជាក់​អះអាង​!',
    'modal_edit_faci' => 'កែតម្រូវ​ព័ត៌មាន​មូលដ្ឋាន​ផលិត',
    /** Report mgmt */
    'monthly_report' => 'របាយការណ៍​ប្រចាំ​ខែ',
    'producing_report' => 'របាយការណ៍​ផលិត',
    'monitoring_report' => 'របាយការណ៍​ត្រួតពិនិត្យ',
    'show_result' => 'បង្ហាញ​លទ្ធផល',
    'start_date' => 'កាលបរិច្ឆេទ​ចាប់ផ្តើម',
    'end_date' => 'កាលបរិច្ឆេទ​ចុងក្រោយ',
    /** Production report */
    'no' => 'លេខ',
    'iodized_salt_produced' => 'អំបិល​អ៊ីយ៉ូដ​ដែល​ផលិត​បាន(​ជា គ.ក្រ)',
    'potassium_used' => 'ម្សៅ​អ៊ីយ៉ូដ​ដែល​បាន​ប្រើ​(​ជា គ.ក្រ)',
    'total_number_days' => 'ចំនួន​ថ្ងៃ​សរុប',
    '%_of_days_producing_0_15ppm' => '%​នៃ​ថ្ងៃ​ដែល​ផលិតផល​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 0-15 ភីភីអឹម',
    '%_of_days_producing_15_30ppm' => '%​នៃ​ថ្ងៃ​ដែល​ផលិតផល​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 15-30 ភីភីអឹម',
    '%_of_days_producing_30_50ppm' => '%​នៃ​ថ្ងៃ​ដែល​ផលិតផល​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 30-50 ភីភីអឹម',
    '%_of_days_producing_50_60ppm' => '%​នៃ​ថ្ងៃ​ដែល​ផលិតផល​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 50-60 ភីភីអឹម',
    '%_of_days_producing_over_60ppm' => '%​នៃ​ថ្ងៃ​ដែល​ផលិតផល​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 60 ភីភីអឹម',
    'ratio_iodized_salt_produced_over_potassium_used' => 'អនុបាត​អំបិល​អ៊ីយ៉ូដ​ដែល​បាន​ផលិត​/​ម្សៅ​អ៊ីយ៉ូដ​ដែល​បាន​ប្រើ',
    /** Inspection report */
    'number_of_inspections' => 'ចំនួន​ដង​នៃ​ការត្រួតពិនិត្យ',
    '%_of_samples_within_0_15ppm' => '%​នៃ​សំណាក​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 0-15 ភីភីអឹម',
    '%_of_samples_within_15_30ppm' => '%​នៃ​សំណាក​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 15-30 ភីភីអឹម',
    '%_of_samples_within_30_60ppm' => '%​នៃ​សំណាក​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 30-60 ភីភីអឹម',
    '%_of_samples_over_60ppm' => '%​នៃ​សំណាក​មាន​ជាតិ​អ៊ីយ៉ូដ​ចន្លោះ​ពី 60 ភីភីអឹម',
    'warning_received' => 'ការព្រមាន​ដែល​បាន​ទទួល',

    'password_mismatched' => 'លេខសម្ងាត់​មិន​ត្រូវ​គ្នា',
    'password_matched' => 'លេខសម្ងាត់​ត្រូវ​គ្នា',
    'email_exists' => 'អាសយដ្ឋាន​អ៊ីមែល​ត្រូវ​បាន​ប្រើប្រាស់​ហើយ​។​សូម​ជ្រើស​អ៊ីមែល​ផ្សេង​។',

    'required_role' => 'តួនាទី​ចាំបាច់​ត្រូវជ្រើសរើស',
    'required_name' => 'ឈ្មោះ​ចាំបាច់​ត្រូវ​បញ្ចូល',
    'required_password' => 'លេខសម្ងាត់​ចាំបាច់ត្រូវ​បញ្ចូល',
    'incorrect_email' => 'ទម្រង់​អ៊ីមែល​មិន​ត្រឹមត្រូវ',
    'required_email' => '​អ៊ីមែល​ចាំបាច់​ត្រូវបញ្ចូល',



];
